{
  "audiovisual_files": {
    "a5e7968a-a0d4-4939-83e7-26488eed8405": {
      "label": "MikeQ - Feels Like (feat. Kevin JZ Prodigy)",
      "is_offline": false,
      "file_url": "https://www.youtube.com/watch?v=tW8curhicTQ",
      "duration": 143,
      "caption_set": [
        {
          "annotation_page_id": "6fcbdd11-b57f-4e68-a11d-4195800b6fef"
        }
      ]
    }
  },
  "auto_generate_web_page": true,
  "description": [
    {
      "type": "paragraph",
      "children": [
        {
          "text": "“Feels Like” by MikeQ, featuring Kevin JZ Prodigy was released in 2011 on the EP Let it All Out. The intro of an infamous ballroom sound, cymbals echoing bring in Kevin JZ Prodigy’s voice to play with the C major key, 130 BPM and a 3B on the DJ camelot wheel (according to Tunebat.com). Although the song features MikeQ’s DJ signature, “This is a DJ MikeQ production”, it doesn’t get realized on “PURE/HONEY”. The presence of a DJ signature on a song is a Black musical tradition that establishes the often-obscured presence of the DJ on a track. This is another example of intervention on the sonic terrain of music, something that can affect the futurity of the artist by public memory and their presence as critical to the work. Beyoncé’s decision not to include MikeQ’s DJ signature is a form of erasure, that perpetuates Black LGBTQ+ sonic obscurity created in the sampling process. "
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "The iconic Kevin JZ Prodigy, aka “THE VOICE OF VOGUE” on Twitter (now X), is a sonic staple for Renaissance as an album and as an MC for the tour. Providing a lesson in the art of ballroom soundscaping through rhythmic commentating, Prodigy hits the cymbal beats with final-word directions to the performer. Repeating the sounds/words “cunt”, “what”, “uh”, “ah”, “ooh”, and “ow”, these are directive moments between Prodigy and performers– creating a dialogic of sound and movement. The type of performance rendered by these directives and onomatopoetic sounds– Meow, Rrr, Titty, dick-tick, brr, diggy-diggy, dick-tick, Riggy, tick, cat-tat, rig-tit-tat-tat, kit-kat, uh, tat-cat, to the rrr, to the kit-kat, Tid-id-id-dit, Rrr, rit-tit, R-r-rat, rat-tat, ta-titty-titty-dit-tat (Lines 14-38)– is very specific, calling for feline-like repertoires of performance based on discourse and sound. As was previously mentioned, the final lines of “Feels Like” are referenced in “PURE/HONEY,” which shows a lineage of concept and sound between the two. The affirmative incantations of cuntiness, repetition of sounds and play on the beat follow Black traditions of sound. Genres like scatting, which is a vocal accompaniment to jazz, can be seen as a predating sonic form of ballroom commentating. Ultimately, the use of onomatopoetic sounds is a critical resource for Prodigy, especially as they perform the sounds and feeling of feline-like cuntiness and femininity as repertoires of Black queer expression. "
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "When asked in an interview to explain the language and embodied expression of ‘cunt’ Prodigy responded with, “Cunt is a feeling, cunt is a mood, cunt is not a read. If you feel cunt, you feel soft, you feel feminine. You feel really good. I feel cunt right now. Do you feel cunt?.. ‘Cunt to the feminine, what!’ Exactly. You have to feel it. You feel cunt walking into your place. You work, you feel cunt with it. But bring the cunt! It's an embodiment. It's a formula. Kevin Aviance started that, and I took and ran with it.” (GQ 2023). The call to feeling cunt and feminine embodied expressions is one that Black sonic traditions have crafted since the early 1990s. It also serves as an affirmation of gender-expansive femininities and how such expressions should spark joy in the everyday. "
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "Although Mike Q and Kevin JZ Prodigy are not regarded properly as Icons by the public, their work and essential presence in the ballroom scene for more than twenty years makes them Iconic. MikeQ being from New Jersey and Kevin JZ Prodigy from Philadelphia, they both came up in the ballroom scene with their respective houses in the early 2000s. MikeQ was a member of the legendary Houses of Evisu, Valentino, LaBeija and now Ebony while Prodigy has been part of the legendary House of Movado. MikeQ’s interview with Tucker in And the Category Is... : Inside New York’s Vogue, House, and Ballroom Community provides intimate insight into MikeQ’s sonic process and inspiration, centering the conversation of the church that is “the holy trinity of the Ballroom floor: DJs, voguers, and MCs.” (Tucker 195). Tucker describes the Black tradition of song as “ a portal into otherly realms, often ones you didn’t even know existed.” (Tucker 186). Within this context, Tucker asks MikeQ the following:"
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "RICKY: Michael [Roberson] talks a lot about the dance floor being a sacred space. He often compares the DJ and the MCs to the pastors, sometimes doing a call-and-response, and that could be at a disco or a ball. So, what MCs and voguers do you like to work with for that synchronicity?"
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "MIKEQ: As far as MCs go, my absolute favorite is Selvin, aka MC Debra. It’s always something different, always creative. Something could happen in the moment at the ball that night, and out of nowhere she’ll make a chant from that moment. That’s always surprising and fun to me. Gregg Evisu, Kevin JZ Prodigy, Precious [Old Navy], Jack [Mizrahi]—I love a lot of the MCs. But you also have your very obnoxious ones, who I won’t name. . . "
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "Not only is the question beautifully crafted, but MIKEQ’s acknowledgement of this type of sacred synchronicity illustrates the Black and queer tradition of socio-spatial practices with sound, performance and community engagement. The Black LGBTQ+ experience of being barred from church makes ballroom a chance to “Carv[e] these sacred spaces out on the ball floor [,which] isn’t just an innate instinct; it’s also an answer to a great loss.” (Tucker 191). From loss comes immaculate creation, which thanks to MikeQ (and Prodigy), the “connection between dance spaces/balls and religious experiences fills a loss stemming from missing their spiritual roots, communal spaces where likeness is found and thanks are given.” (Tucker 192). To Tucker’s question, “What about the sound appealed to you, and what tracks drew you in?” MikeQ responds with: "
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "I was hearing songs like ‘Din Da Da,’ [by Kevin Aviance] ‘Satisfaction,’ ‘Make These Bitches Gag’ by DJ Vjuan Allure. I didn’t know who Vjuan was at the time, and the track actually said his name in it. I didn’t even know what they were saying; it seemed like some other kind of language to me. I’d never heard a name like that, Vjuan, only to find out how special he’d be to me and the entire community. But there was something about the music and the dancing… I think both of them combined is what really grasped me. Maybe the voguing alone could have gotten me, but in that moment, it was the collaboration of the two, and honestly, I wasn’t into DJing or anything before—Ballroom brought that talent out of me. (Tucker 197)"
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "The concept of “gagging” is a part of the Black LGBTQ+ discursive repertoire which MikeQ was exposed to with DJ Vjuan Allure. This “other kind of language”– sonically, discursively, and performatively– speaks to the expansiveness of Black LGBTQ+ epistemologies that move across different forms of sound and body, and linguistic forms. Ultimately, knowledge of these various repertoires in form are significant because not every song will garner the same performance, category and cultural formation. "
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "The epistemology of Black sound– between gospel music, to samples of “hip-hop or R&B, pop, viral videos, TV themes, movie lines”– is encapsulated by ballroom and Black LGBTQ+ artists who may not have the chance to enter these spaces physically but can assert their own perspectives and selfhood through mixes (Tucker 199). It is through these mixes that artists have been able to intervene, remix and add to the repertoire of Black queer cultural forms and genre. MikeQ references his hometown genre of Jersey club music, “which is just flipping hip-hop songs into these more danceable versions, which is basically what is done in Ballroom.” (Tucker 199). DJs, MCs and performers by this end flip or ‘queer’ Black cultural forms to realign themselves with Black history and Black futures. This is another act of soundscaping that re-grounds Black queerness in sound. Black LGBTQ+ cultural makers then are able to transcend fixedness in time and the physical estrangement from public place as queer people. Ballroom music is a remaking of Black cultural forms, creating new meaning through movement and between individuals within the Black LGBTQ+ community."
        }
      ]
    }
  ],
  "citation": "\"Black LGBTQ+ Sound and the Politics of Illegitmated Language:  Ballroom Soundscapes, Mixes and Beyond\" ",
  "item_type": "Video",
  "label": "Sample 3: \"Feels Like\" by MikeQ & Kevin JZ Prodigy",
  "created_at": "2025-01-21T02:07:31.911Z",
  "created_by": "Alyssaf-j",
  "updated_at": "2025-01-21T04:10:59.703Z",
  "updated_by": "Alyssaf-j"
}