{
  "publish": {
    "publish_pages_app": true,
    "publish_sha": "",
    "publish_iso_date": ""
  },
  "users": [],
  "project": {
    "github_org": "Alyssaf-j",
    "is_private": false,
    "title": "Black LGBTQ+ Sound and the Politics of Illegitmated Language: Ballroom Soundscapes, Mixes and Beyond",
    "description": "My Master's Report maps Black LGBTQ+ language and sonic culture in the late 21st century from Beyoncé's samples in the Renaissance album. These samples are a rich archive of Black femme, queer, trans and gender non-conforming language, soundscapes, performance, identity/kinship systems and critical Black queer geographies that call for deeper exploration. As a linguistics and Black Studies scholar, I utilize sociolinguistic methods of discourse analysis (social impact/identity formation), phonetic/phonological analysis (sound production), and regional dialectal analysis (NY/NJ, Texas and Philly AAE) (Lanehart 2021). My theoretical frameworks are sonic labor & Black queer work of language (Brooks 2023) (Lane 2019), soundscapes (Schafer 1994), the queer Black aesthetic of the \"unmastered\" (Powell 2019), queer of color critique (Ferguson 2004), and sonic Afro-modernity (Weheliye 2005). These are all featured as annotations of the samples I am analyzing, and major themes are the annotation sets: \n\nAbstract:\nNon-Black, cis-heterosexual people co-opt Black queer language and sound in ways that harm and betray Black LGBTQ+ people. This article considers mainstream appropriations of Black queer language and examines the influence and reverence of Black LGBTQ+ language and sound practices from the late 1990s to today. Through a sound study of Beyoncé’s “PURE/HONEY,” the penultimate song on her Renaissance album, I acknowledge and honor the sonic labor, epistemological, ontological fullness and significant influence of Black LGBTQ+ histories on global expressions of sound and language. The sonic labor of Black LGBTQ+ artists that inspire Beyoncé and mainstream society should be acknowledged in the archive and public memory.\nBlack LGBTQ+ language and sound, although ephemeral utterances and performances, are also rich systems of queered African American Englishes and its accompanying soundscapes. I analyze that language system of Black LGBTQ+ discourse, phonological and morphological features. Beyond this, the soundscapes I analyze are that of Black femme, queer, trans and gender non-conforming (GNC) voices, instrumentations and performances in music, television and mainstream media. These acts are what I consider soundscaping, which is a powerful tool of meaning-making deriving from and further informing Black linguistic tradition, geographies and sonic history. Despite the Black LGBTQ+ community’s soundscaping labor, their cultural authorship is often erased in the process. Beyoncé’s Renaissance commercialized, packaged and disseminated Black LGBTQ+ sound as popular music because it has always been present in the mainstream, which needs to be asserted. Representation and meaning, however, are seriously transformed through the recording of music and performance at live concerts– demanding us to reconsider how we re-piece, re-acknowledge, remember and pay reverence to the cultural makers of music in our everyday engagement with their work.  \n“PURE/HONEY” is a mainstream cultural product deriving from a robust Black LGBTQ+ epistemology and literacy in performance and soundscaping practices. I use the term soundscaping here to describe the Black community at large, and more specifically the Black LGBTQ+ community’s sonic practices. The distinction is that Black LGBTQ+ soundscaping had initially engaged and shifted the physical world, personal lives and material conditions of community members in the ballroom system. Now, taken to the global soundscape with a tour, Black LGBTQ+ individuals’ roles in shaping global sounds with speakers of the community and not, must be examined. I examine the song “PURE/HONEY” through linguistics, sound studies, Black studies, queer and trans studies, to address how music, artists and audiences remember and perpetuate Black LGBTQ+ life linguistically and sonically. \n\nKeywords: Black LGBTQ+ sound and performance, illegitimated language and sound, soundscapes, Black LGBTQ+ soundscaping, ballroom, mixes, politics of language\n",
    "language": "en",
    "slug": "masters-report",
    "creator": "Alyssaf-j",
    "authors": "Alyssa Frick-Jenkins",
    "media_player": "avannotate",
    "auto_populate_home_page": true,
    "additional_users": [],
    "tags": {
      "tagGroups": [
        {
          "category": "Speaker",
          "color": "#ADFFD9"
        },
        {
          "color": "#ADFEFF",
          "category": "Black Sonic Traditions"
        },
        {
          "color": "#F7ED78",
          "category": "Black LGBTQ+ Discourse"
        },
        {
          "color": "#99AFF2",
          "category": "Ballroom Culture"
        },
        {
          "color": "#F2A7C3",
          "category": "Misc"
        }
      ],
      "tags": [
        {
          "category": "Speaker",
          "tag": "MikeQ"
        },
        {
          "category": "Black Sonic Traditions",
          "tag": "adlibs"
        },
        {
          "category": "Black Sonic Traditions",
          "tag": "DJ signature"
        },
        {
          "category": "Speaker",
          "tag": "Kevin JZ Prodigy"
        },
        {
          "category": "Black Sonic Traditions",
          "tag": "MCing"
        },
        {
          "category": "Speaker",
          "tag": "Kevin JZ Prodigy"
        },
        {
          "category": "Black Sonic Traditions",
          "tag": "scatting"
        },
        {
          "category": "Speaker",
          "tag": "Kevin JZ Prodigy"
        },
        {
          "category": "Speaker",
          "tag": "Kevin JZ Prodigy"
        },
        {
          "category": "Speaker",
          "tag": "Kevin JZ Prodigy"
        },
        {
          "category": "Speaker",
          "tag": "Kevin JZ Prodigy"
        },
        {
          "category": "Speaker",
          "tag": "Kevin JZ Prodigy"
        },
        {
          "category": "Black LGBTQ+ Discourse",
          "tag": "cunt discourse"
        },
        {
          "category": "Black LGBTQ+ Discourse",
          "tag": "onomatopoetics"
        },
        {
          "category": "Ballroom Culture",
          "tag": "repitition"
        },
        {
          "category": "Ballroom Culture",
          "tag": "remixing"
        },
        {
          "category": "Ballroom Culture",
          "tag": "Black LGBTQ+ discourse"
        },
        {
          "category": "Black Sonic Traditions",
          "tag": "percussive element"
        },
        {
          "category": "Ballroom Culture",
          "tag": "embodied performance"
        },
        {
          "category": "Ballroom Culture",
          "tag": "performance marking"
        },
        {
          "category": "Misc",
          "tag": "Black LGBTQ+ Discourse"
        }
      ]
    },
    "created_at": "2025-01-21T01:47:31.145Z",
    "updated_at": "2025-03-27T15:15:41.908Z",
    "generate_pages_site": true
  },
  "is_private": false
}