{
  "content": [
    {
      "type": "paragraph",
      "children": [
        {
          "text": "Soundscapes have been theorized across multiple disciplines like anthropology, musicology, urban ecology and now with sound studies. Canadian composer, music educator and ecologist R. Murray Schafer popularized the term in academia with his book The Soundscape: Our Sonic Environment and the Tuning of the World (1994). He developed the discipline of ‘acoustic ecology’ as “the study of sounds in relationship to life and society” (Schafer 205). Schafer extended his soundscape framework into a typology of the three kinds of sounds, a ‘keynote’, a ‘signal’, and ‘soundmarks’ (Shafer 10). Keynote refers to sound produced by nature, geography and climate; signal sounds are produced by alarms, foregrounding human atmospheres and they are listened to consciously; soundmarks derives from ‘landmark’ and are sounds unique to an area (Schafer 1994). For this paper, the focus will be on soundmarks, which according to Schafer, “Once a Soundmark has been identified, it deserves to be protected, for soundmarks make the acoustic life of a community unique” (Shafer 10). With this methodological tool in use, I center the ballroom space as a critical geography for the Black and queer body to soundscape and preserve the acoustic life of the Black LGBTQ+ community. This brings me to my main argument: the sovereignty of Black LGBTQ+ language systems, sound systems and soundscapes are elided by contemporary musical renderings like “PURE/HONEY” and other mainstream appropriations. Soundscaping and soundscapes have an integral function in ballroom culture for the Black LGBTQ+ community, so its appropriation and endangerment by outside communities contributes to its erasure, misrepresentation and ultimately linguistically driven-harm. That harm lies within language and discourse used by non-Black, non-LGBTQ+ voices making no clear or accurate reference to the origins of sound, opening the potential for (mis)interpretation and leading to further misuse as the norm. Musical examples of this include K-Pop, global Hip-Hop and Jazz, Rock and Roll and Country. All of these genres appropriate Black and queer cultural forms, language and sound."
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "Black LGBTQ+ Icons and Legends soundcape through sonic improvisation and innovation, eccentric gestures of the body, and music mixes to approach an expansiveness of expression and performance. As a result, a fugitive system of language, sound and culture provides the Black LGBTQ+ community (and others) an escape from the confines of standard, Eurocentric, heterocentric language and sound. The “Black queer work” of language , or the everyday labor of Black queer and trans individuals, maintains the tradition and functional intricacies of Black queer systems– including ballroom which is a major subject of this article. Through soundscaping, Black queer language is semantically made physical and structural with rules of engagement.  "
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "In “Gender/Racial Realness: Theorizing the Gender System in Ballroom Culture” Marlon Bailey defines ballroom culture as a “community and network of Black and Latina/o women, men, and transgender women and men who are lesbian, gay, bisexual, straight, and queer. The Black and Latina/o queer members of this community use performance to create an alternative discursive terrain and a kinship structure that critiques and revises dominant notions of gender, sexuality, family, and community. (Bailey 367). The Black LGBTQ+ community’s creation of an “alternative discursive terrain” is essentially what I have referred to as soundscaping. The ballroom soundscape demonstrates the Black LGBTQ+ community’s differing traditions in form– with language and sound practice, performance, and engagement and attachment to sound and space, respectively. "
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "Black femmes, queer and trans people are doubly-dispossessed– making the sovereignty and ownership of soundscapes, sonic geographies is necessary. I plan to create my own Black soundscape archive of NYC that maps ballroom spaces, clubs and other Black LGBTQ+ locales that upheld sonic and linguistic cultures."
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "Examples of Black soundscape(s) archives:",
          "bold": true
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "Chicago Black Social Culture Map:",
          "link": "https://cbscmap.omeka.net/"
        },
        {
          "text": "https://cbscmap.omeka.net/"
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "Sonic Street Technologies:",
          "link": "https://sonic-street-technologies.com/"
        },
        {
          "text": "https://sonic-street-technologies.com/"
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": ""
        }
      ]
    }
  ],
  "title": "Soundscapes",
  "autogenerate": {
    "enabled": false,
    "type": "custom"
  },
  "slug": "soundscapes",
  "created_at": "2025-01-21T04:58:02.721Z",
  "created_by": "Alyssaf-j",
  "updated_at": "2025-03-27T17:26:36.634Z",
  "updated_by": "Alyssaf-j"
}