{
  "content": [
    {
      "type": "paragraph",
      "children": [
        {
          "text": "Soundscapes have been theorized across multiple disciplines like anthropology, musicology, urban ecology and now with sound studies. Canadian composer, music educator and ecologist R. Murray Schafer popularized the term with his book The Soundscape: Our Sonic Environment and the Tuning of the World. He developed the discipline of ‘acoustic ecology’ as “the study of sounds in relationship to life and society” (Schafer 205). Schafer extended his soundscape framework into a typology of the three kinds of sounds, a ‘’keynote, a ‘signal’, and ‘soundmarks’ (Shafer 10). With this definition in mind, I center the Black and queer body as a primary resource for soundscaping as an act, with its own sound typology that I expand on in the Discussion. Ultimately, the Black LGBTQ+ community’s soundscaping labor creates spaces through sonic means, with music and performing bodies shaping the rules of the space. "
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "Black LGBTQ+ Icons and Legends soundcape through sonic improvisation and innovation, eccentric gestures of the body, and music mixes to approach an expansiveness of expression and performance. As a result, a fugitive system of language, sound and culture provides the Black LGBTQ+ community (and others) an escape from the confines of standard, Eurocentric, heterocentric language and sound. The “Black queer work” of language , or the everyday labor of Black queer and trans individuals, maintains the tradition and functional intricacies of Black queer systems– including ballroom which is a major subject of this article. Through soundscaping, Black queer language is semantically made physical and structural with rules of engagement.  "
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "In “Gender/Racial Realness: Theorizing the Gender System in Ballroom Culture” Marlon Bailey defines ballroom culture as a “community and network of Black and Latina/o women, men, and transgender women and men who are lesbian, gay, bisexual, straight, and queer. The Black and Latina/o queer members of this community use performance to create an alternative discursive terrain and a kinship structure that critiques and revises dominant notions of gender, sexuality, family, and community. (Bailey 367). The Black LGBTQ+ community’s creation of an “alternative discursive terrain” is essentially what I have referred to as soundscaping. The ballroom soundscape demonstrates the Black LGBTQ+ community’s differing traditions in form– with language and sound practice, performance, and engagement and attachment to sound and space, respectively. "
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "p. 9-10"
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": ""
        }
      ]
    }
  ],
  "title": "Soundscapes",
  "autogenerate": {
    "enabled": false,
    "type": "custom"
  },
  "slug": "soundscapes",
  "created_at": "2025-01-21T04:58:02.721Z",
  "created_by": "Alyssaf-j",
  "updated_at": "2025-02-11T04:09:19.706Z",
  "updated_by": "Alyssaf-j"
}